benchmark/leveldb/results/facebook/mris_facebook_hybrid.17.2.log
LevelDB:    version 1.5
Date:       Sun Dec  2 17:34:04 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    2688.531 micros/op;    5.3 MB/s small: 5000/0; big: 295/0
Microseconds per op:
Count: 5295  Average: 2688.5685  StdDev: 5423.31
Min: 0.0000  Median: 1479.3275  Max: 49424.0000
------------------------------------------------------
[       0,       1 )       2   0.038%   0.038% 
[       1,       2 )      14   0.264%   0.302% 
[       2,       3 )      39   0.737%   1.039% 
[       3,       4 )       2   0.038%   1.076% 
[      20,      25 )       8   0.151%   1.228% 
[      25,      30 )      47   0.888%   2.115% 
[      30,      35 )     126   2.380%   4.495% 
[      35,      40 )     408   7.705%  12.200% ##
[      40,      45 )     389   7.347%  19.547% #
[      45,      50 )      37   0.699%  20.246% 
[      50,      60 )      40   0.755%  21.001% 
[      60,      70 )       4   0.076%  21.076% 
[      70,      80 )       3   0.057%  21.133% 
[      80,      90 )      49   0.925%  22.059% 
[      90,     100 )     205   3.872%  25.930% #
[     100,     120 )     180   3.399%  29.330% #
[     120,     140 )     105   1.983%  31.313% 
[     140,     160 )      70   1.322%  32.635% 
[     160,     180 )      30   0.567%  33.201% 
[     180,     200 )      17   0.321%  33.522% 
[     200,     250 )      13   0.246%  33.768% 
[     250,     300 )       2   0.038%  33.805% 
[     400,     450 )       5   0.094%  33.900% 
[     450,     500 )       3   0.057%  33.957% 
[     500,     600 )       5   0.094%  34.051% 
[     600,     700 )       2   0.038%  34.089% 
[     700,     800 )      16   0.302%  34.391% 
[     800,     900 )      37   0.699%  35.090% 
[     900,    1000 )      87   1.643%  36.733% 
[    1000,    1200 )     226   4.268%  41.001% #
[    1200,    1400 )     158   2.984%  43.985% #
[    1400,    1600 )     803  15.165%  59.150% ###
[    1600,    1800 )      74   1.398%  60.548% 
[    1800,    2000 )       7   0.132%  60.680% 
[    2000,    2500 )      50   0.944%  61.624% 
[    2500,    3000 )    1443  27.252%  88.876% #####
[    3000,    3500 )     272   5.137%  94.013% #
[    3500,    4000 )      21   0.397%  94.410% 
[    4000,    4500 )       1   0.019%  94.429% 
[    5000,    6000 )       1   0.019%  94.448% 
[   10000,   12000 )       3   0.057%  94.504% 
[   12000,   14000 )       6   0.113%  94.618% 
[   14000,   16000 )      10   0.189%  94.806% 
[   16000,   18000 )      18   0.340%  95.146% 
[   18000,   20000 )      19   0.359%  95.505% 
[   20000,   25000 )     114   2.153%  97.658% 
[   25000,   30000 )      99   1.870%  99.528% 
[   30000,   35000 )      22   0.415%  99.943% 
[   40000,   45000 )       2   0.038%  99.981% 
[   45000,   50000 )       1   0.019% 100.000% 

----- /mnt/largespace/mris_facebook_hybrid_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	295
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0