benchmark/leveldb/results/facebook/mris_facebook_ssd.17.1.log
LevelDB:    version 1.5
Date:       Sun Dec  2 17:15:56 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1671.209 micros/op;    8.6 MB/s small: 5000/0; big: 295/0
Microseconds per op:
Count: 5295  Average: 1671.2321  StdDev: 1555.25
Min: 0.0000  Median: 1478.8679  Max: 14833.0000
------------------------------------------------------
[       0,       1 )      27   0.510%   0.510% 
[       1,       2 )      55   1.039%   1.549% 
[       2,       3 )     205   3.872%   5.420% #
[       3,       4 )       6   0.113%   5.534% 
[       4,       5 )       1   0.019%   5.552% 
[      12,      14 )       1   0.019%   5.571% 
[      20,      25 )       6   0.113%   5.685% 
[      25,      30 )      46   0.869%   6.553% 
[      30,      35 )      57   1.076%   7.630% 
[      35,      40 )     351   6.629%  14.259% #
[      40,      45 )     324   6.119%  20.378% #
[      45,      50 )       8   0.151%  20.529% 
[      50,      60 )      28   0.529%  21.058% 
[      60,      70 )       2   0.038%  21.095% 
[      70,      80 )       1   0.019%  21.114% 
[      80,      90 )      58   1.095%  22.210% 
[      90,     100 )     213   4.023%  26.232% #
[     100,     120 )     176   3.324%  29.556% #
[     120,     140 )     100   1.889%  31.445% 
[     140,     160 )      70   1.322%  32.767% 
[     160,     180 )      25   0.472%  33.239% 
[     180,     200 )      18   0.340%  33.579% 
[     200,     250 )      11   0.208%  33.787% 
[     250,     300 )       2   0.038%  33.824% 
[     400,     450 )       5   0.094%  33.919% 
[     450,     500 )       2   0.038%  33.957% 
[     500,     600 )       5   0.094%  34.051% 
[     600,     700 )       4   0.076%  34.127% 
[     700,     800 )      14   0.264%  34.391% 
[     800,     900 )      37   0.699%  35.090% 
[     900,    1000 )      91   1.719%  36.808% 
[    1000,    1200 )     222   4.193%  41.001% #
[    1200,    1400 )     163   3.078%  44.079% #
[    1400,    1600 )     795  15.014%  59.093% ###
[    1600,    1800 )      80   1.511%  60.604% 
[    1800,    2000 )       7   0.132%  60.737% 
[    2000,    2500 )      44   0.831%  61.568% 
[    2500,    3000 )    1417  26.761%  88.329% #####
[    3000,    3500 )     296   5.590%  93.919% #
[    3500,    4000 )      59   1.114%  95.033% 
[    4000,    4500 )      60   1.133%  96.166% 
[    4500,    5000 )      21   0.397%  96.563% 
[    5000,    6000 )      69   1.303%  97.866% 
[    6000,    7000 )      60   1.133%  98.999% 
[    7000,    8000 )      50   0.944%  99.943% 
[    8000,    9000 )       2   0.038%  99.981% 
[   14000,   16000 )       1   0.019% 100.000% 

----- /mnt/largespace/mris_facebook_ssd_db statistics: -----
nr_new_large_values_ 	25
nr_success_lookups_ 	295
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0