benchmark/leveldb/results/facebook/mris_facebook_ssd.17.2.log
LevelDB:    version 1.5
Date:       Sun Dec  2 17:16:05 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1669.460 micros/op;    8.6 MB/s small: 5000/0; big: 295/0
Microseconds per op:
Count: 5295  Average: 1669.4967  StdDev: 1544.37
Min: 0.0000  Median: 1480.1266  Max: 8590.0000
------------------------------------------------------
[       0,       1 )      30   0.567%   0.567% 
[       1,       2 )      44   0.831%   1.398% 
[       2,       3 )     208   3.928%   5.326% #
[       3,       4 )      12   0.227%   5.552% 
[      10,      12 )       1   0.019%   5.571% 
[      20,      25 )       6   0.113%   5.685% 
[      25,      30 )      37   0.699%   6.383% 
[      30,      35 )      53   1.001%   7.384% 
[      35,      40 )     298   5.628%  13.012% #
[      40,      45 )     382   7.214%  20.227% #
[      45,      50 )      17   0.321%  20.548% 
[      50,      60 )      27   0.510%  21.058% 
[      60,      70 )       2   0.038%  21.095% 
[      80,      90 )      61   1.152%  22.247% 
[      90,     100 )     206   3.890%  26.138% #
[     100,     120 )     180   3.399%  29.537% #
[     120,     140 )      91   1.719%  31.256% 
[     140,     160 )      74   1.398%  32.653% 
[     160,     180 )      28   0.529%  33.182% 
[     180,     200 )      18   0.340%  33.522% 
[     200,     250 )      12   0.227%  33.749% 
[     250,     300 )       2   0.038%  33.787% 
[     300,     350 )       1   0.019%  33.805% 
[     400,     450 )       4   0.076%  33.881% 
[     450,     500 )       3   0.057%  33.938% 
[     500,     600 )       5   0.094%  34.032% 
[     600,     700 )       4   0.076%  34.108% 
[     700,     800 )      14   0.264%  34.372% 
[     800,     900 )      35   0.661%  35.033% 
[     900,    1000 )      89   1.681%  36.714% 
[    1000,    1200 )     224   4.230%  40.944% #
[    1200,    1400 )     163   3.078%  44.023% #
[    1400,    1600 )     790  14.920%  58.942% ###
[    1600,    1800 )      83   1.568%  60.510% 
[    1800,    2000 )       8   0.151%  60.661% 
[    2000,    2500 )      56   1.058%  61.719% 
[    2500,    3000 )    1431  27.025%  88.744% #####
[    3000,    3500 )     279   5.269%  94.013% #
[    3500,    4000 )      48   0.907%  94.920% 
[    4000,    4500 )      62   1.171%  96.091% 
[    4500,    5000 )      24   0.453%  96.544% 
[    5000,    6000 )      71   1.341%  97.885% 
[    6000,    7000 )      61   1.152%  99.037% 
[    7000,    8000 )      48   0.907%  99.943% 
[    8000,    9000 )       3   0.057% 100.000% 

----- /mnt/largespace/mris_facebook_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	295
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0